{
    "title": "Tagir",
    "tab0": "Introduction",
    "tab1": "Work",
    "tab2": "Contact",
    "videos-title": "HOBBIES",
    "videos-text": "A couple of years ago, I made games on the Dreams game development platform (when I probably should have been studying computer engineering). Implementing logic in Dreams is a process quite similar to modern coding languages or game development platforms.",

    "aboutTitle": "Portfolio 2023",
    "aboutText": "I have learned a wide range of technologies, but my current expertise lies in Java, Android, React, Javascript, and Spring Boot.",
    "actualAboutText": "Hello, I am currently seeking a junior/internship position. I may have spent too much time working on these portfolio projects rather than focusing on job hunting. I constantly imagine the projects are still incomplete, and it takes months longer to finish the work than intended. Another mistake I've made is not reading enough code, so the code in previous projects was quite unique. Nowadays, I spend part of my day reading code. I am currently examining the source code of the Hibernate library.",
    "actualAboutTitle": "Tagir Tirkkonen",
    "works": "Work",
    "work-info": "I have completed four major applications so far, and I plan to release at least two of them on the app store soon.",

    "skills1": "Languages",
    "skills2": "Frameworks",
    "skills3": "Databases",

    "topicPlus": "Some things I've learned:",

    "topic1Title": "Star Chat",
    "topic1Text": "A chat application where all text is written in a Star Wars-inspired style",
    "topic1List": [
        "MVVM",
        "REST",
        "Notifications",
        "Content Resolver",
        "OpenGL (text rendering / textures / buffers / shaders / text layout algorithms, font data handling, matrix calculations, GLSL, shader compilation)",
        "MotionEvent",
        "Firebase (real-time database / Firestore / Firebase messaging)",
        "Permission management",
        "Best practices",
        "Mockito",
        "Espresso"
    ],

    "topic2Title": "Visual Metronome",
    "topic2Text": "An app that aims to detect rhythms in music",
    "topic2List": [
        "AudioRecord",
        "AudioManager",
        "Timer",
        "Multithreading",
        "AudioTrack",
        "OpenGL (GL SurfaceView, Renderer, line drawing)",
        "Audio buffers",
        "Fast Fourier Transform, autocorrelation, and other pitch detection algorithms"
    ],

    "topic3Title": "Your Mind Map",
    "topic3Text": "A program for creating mind maps",
    "topic3List": [
        "Java",
        "OOP",
        "Android Studio",
        "Activities",
        "Fragments",
        "Canvas",
        "Internal and external storage",
        "CustomView",
        "Map layout algorithms",
        "XML",
        "Bitmap",
        "RecyclerView",
        "ListView",
        "Adapters",
        "Animations",
        "ViewPager2",
        "ConstraintLayout, ConstraintSet",
        "Touch events"
    ],

    "topic4Title": "GPS Golf (first coding project)",
    "topic4Text": "An AR golf game played using mobile GPS navigation",
    "topic4List": [
        "Visual Studio (Forms, Buttons)",
        "C# (LINQ)",
        "Data structures (combining and arranging 900 million coordinates)",
        "Unity (Mesh rendering based on coordinates in a 3D environment according to the Earth's radius)",
        "Google Cloud, CLI for handling large files",
        "Async methods",
        "Permission management",
        "GPS methods for coordinate management and obtaining the correct map data from Google Cloud based on location"
    ],

    "topic5Title": "CSAMMA",
    "topic5Text": "CSAMMA (Cosine Search Automatic Mind Map Application) is a full-stack application that automatically creates a mind map from a given website using web scraping and search terms. For example, if you enter the word 'fish' in the search field, the application generates a mind map of website domains related to the word 'fish'.",
    "topic5List": [
        "Spring Boot (JpaRepository, Hibernate, Native SQL Batching, Entities)",
        "Application architecture",
        "MySQL",
        "SQL",
        "Javascript",
        "React (useEffect, useRef, useState, Canvas, map, props)",
        "Jsoup",
        "Language models"
    ],

    "topic6Title": "AfricanRockPython",
    "topic6Text": "AfricanRockPython is a full-stack webshop application for computer components. It can generate assembly recommendations for computer parts based on user choices. The project was originally intended to practice design patterns, and about 12 of them have been used in the project. The application selects compatible components using compatibility data and user preferences regarding price range and computer usage.",
    "topic6List": [
        "Spring Boot",
        "Hibernate (ManyToMany, ManyToOne, strange proxy issues, strange transaction session issues, InheritanceTypes, CascadeTypes, Batching)",
        "JDBC",
        "Cookies (session token)",
        "Spring Security (to some extent)",
        "Design patterns (FactoryMethod, AbstractFactory, Builder, Facade, Proxy, Decorator, Strategy, Observer, Singleton, Composite, Prototype, State)",
        "React (Redux, pages, Axios)",
        "Web Scraping (Selenium)",
        "Jackson",
        "MySQL"
    ],

    "privacyPolicy": "Privacy Policy",
    "goodToKow": "Response time is likely to be relatively short",
    "language": "Finnish",
    "learn more": "GitHub",
    "contact": "Contact",
    "email": "tagir.tirkkonen@gmail.com",
    "phone": "+358401865843",
    "location": "Silfverhjelmintie 8, Mustio",
    "email-name": "EMAIL",
    "location-name": "LOCATION",
    "phone-name": "PHONE",
    "skills": "Skills",
    "link-explain":"may open slowly because of heroku"
}
